<a href="https://colab.research.google.com/github/KhannaUjjwal/Machine-learning/blob/main/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

First Statement is for importing libraries

In [1]:
import pandas as pd 
import numpy as np
imjport matplotlib.pylot as plt

Create a Dataframe

In [35]:
columns = ['name','age','gender','job']
user1 = pd.DataFrame([['Ujjwal',21,'M','Student'],
['Samar',20,'M','Student']],
columns=columns)
user2 = pd.DataFrame([['Sahil',22,'M','Student'],
['Suryansh',19,'M','Manager']],columns=columns)
user3 = pd.DataFrame(dict(name=['Rahul','Rimmy'],
age=[33,44], gender=['M','F'],
job=['engineer','scientist']))
user1.append(user2)
users = pd.concat([user1, user2, user3])
print(users)

       name  age gender        job
0    Ujjwal   21      M    Student
1     Samar   20      M    Student
0     Sahil   22      M    Student
1  Suryansh   19      M    Manager
0     Rahul   33      M   engineer
1     Rimmy   44      F  scientist

In [8]:
type(users)

pandas.core.frame.DataFrame

In [9]:
users.head()

       name age gender       job
0    Ujjwal  21      M   Student
1     Samar  20      M   Student
0     Sahil  22      M   Student
1  Suryansh  19      M   Manager
0     Rahul  33      M  engineer

In [16]:
users.tail()

       name age gender        job
1     Samar  20      M    Student
0     Sahil  22      M    Student
1  Suryansh  19      M    Manager
0     Rahul  33      M   engineer
1     Rimmy  44      F  scientist

In [11]:
users.index

Int64Index([0, 1, 0, 1, 0, 1], dtype='int64')

In [13]:
users.columns

Index(['name', 'age', 'gender', 'job'], dtype='object')

In [36]:
users.dtypes

name      object
age        int64
gender    object
job       object
dtype: object

In [15]:
users.shape

(6, 4)

In [17]:
users.values

array([['Ujjwal', '21', 'M', 'Student'],
       ['Samar', '20', 'M', 'Student'],
       ['Sahil', '22', 'M', 'Student'],
       ['Suryansh', '19', 'M', 'Manager'],
       ['Rahul', 33, 'M', 'engineer'],
       ['Rimmy', 44, 'F', 'scientist']], dtype=object)

In [18]:
users['gender'] # select on column

0    M
1    M
0    M
1    M
0    M
1    F
Name: gender, dtype: object

In [19]:
type(users['gender']) #Series

pandas.core.series.Series

In [20]:
users.gender #select column

0    M
1    M
0    M
1    M
0    M
1    F
Name: gender, dtype: object

In [21]:
#select multiple columns
users[['age','gender']] #select two columns

  age gender
0  21      M
1  20      M
0  22      M
1  19      M
0  33      M
1  44      F

In [26]:
my_cols = ['age','gender'] #or , create a list...
users[my_cols] # ...and use that list to select columns

  age gender
0  21      M
1  20      M
0  22      M
1  19      M
0  33      M
1  44      F

In [27]:
df = users.copy()
df.iloc[0] # first row

name       Ujjwal
age            21
gender          M
job       Student
Name: 0, dtype: object

In [28]:
df.iloc[0,0] # first item of first row

'Ujjwal'

In [38]:
users[users.age<40] # show user with age < 40

       name  age gender       job
0    Ujjwal   21      M   Student
1     Samar   20      M   Student
0     Sahil   22      M   Student
1  Suryansh   19      M   Manager
0     Rahul   33      M  engineer

In [39]:
users[users.age<40][['age','job']] #select multiple column

   age       job
0   21   Student
1   20   Student
0   22   Student
1   19   Manager
0   33  engineer

In [41]:
users[users.job.isin(['Student','engineer'])] #filter specific value

     name  age gender       job
0  Ujjwal   21      M   Student
1   Samar   20      M   Student
0   Sahil   22      M   Student
0   Rahul   33      M  engineer

In [42]:
df = users.copy()
df.age.sort_values() #only works for a series

1    19
1    20
0    21
0    22
0    33
1    44
Name: age, dtype: int64

In [43]:
df.sort_values(by='age', ascending=False) #use descending order instead

       name  age gender        job
1     Rimmy   44      F  scientist
0     Rahul   33      M   engineer
0     Sahil   22      M    Student
0    Ujjwal   21      M    Student
1     Samar   20      M    Student
1  Suryansh   19      M    Manager

In [44]:
df.sort_values(by=['job','age']) # sort by multiple column

       name  age gender        job
1  Suryansh   19      M    Manager
1     Samar   20      M    Student
0    Ujjwal   21      M    Student
0     Sahil   22      M    Student
0     Rahul   33      M   engineer
1     Rimmy   44      F  scientist

Descriptive Stats(Summerize all numeric columns)

In [45]:
print(df.describe())

             age
count   6.000000
mean   26.500000
std     9.974969
min    19.000000
25%    20.250000
50%    21.500000
75%    30.250000
max    44.000000

In [46]:
print(df.describe(include='all'))

         name        age gender      job
count       6   6.000000      6        6
unique      6        NaN      2        4
top     Rahul        NaN      M  Student
freq        1        NaN      5        3
mean      NaN  26.500000    NaN      NaN
std       NaN   9.974969    NaN      NaN
min       NaN  19.000000    NaN      NaN
25%       NaN  20.250000    NaN      NaN
50%       NaN  21.500000    NaN      NaN
75%       NaN  30.250000    NaN      NaN
max       NaN  44.000000    NaN      NaN

In [47]:
df = users.append(df.iloc[0], ignore_index=True)
print(df.duplicated())# series of booleans
# (True if a row is identical to previous row)

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [49]:
df.duplicated().sum() #count of duplicates

1

In [52]:
df[df.duplicated()] #only show duplicates

     name  age gender      job
6  Ujjwal   21      M  Student

In [53]:
df=df.drop_duplicates()
print(df)

       name  age gender        job
0    Ujjwal   21      M    Student
1     Samar   20      M    Student
2     Sahil   22      M    Student
3  Suryansh   19      M    Manager
4     Rahul   33      M   engineer
5     Rimmy   44      F  scientist